Revit 2025 API
IFCCategoryTemplate.CopyTemplate Method
 Create copy of mapping template with new name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public IFCCategoryTemplate CopyTemplate(
	Document document,
	string copyTemplateName
)
Public Function CopyTemplate (
	document As Document,
	copyTemplateName As String
) As IFCCategoryTemplate
public:
IFCCategoryTemplate^ CopyTemplate(
	Document^ document,
	String^ copyTemplateName
)
member CopyTemplate :
        document : Document *
        copyTemplateName : string -> IFCCategoryTemplate
Parameters
document Document
 A Revit document.
copyTemplateName String
 A name for copied template name.
Return Value
IFCCategoryTemplate
 The copied mapping template element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to create IFCCategoryTemplate element.
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace